// join() ใช้สำหรับ การนำค่าแต่ละค่าในตัวแปร array มารวมกันเป็นข้อความ และส่งค่ากลับเป็นข้อความ ที่มีตัวคั่นค่าตัวแปรแต่ละค่า ตามที่กำหนด
// ถ้าไม่ได้กำหนด จะเป็นเครื่องหมาย (,) ให้โดยอัตโนมัติ

let names = ['A', 'B', 'C', 'D']; //ตัวแปรใน array
let nums = ['1', '2', '3', '4']; //ตัวแปรใน array

// ไม่ได้กำหนดตัวขั้นตัวแปร ผลที่คือการนำตัวแปรใน array มาเรียงต่อกันและคั่นด้วย (,) โดยจะเป็น A,B,C,D เนื่องจากถ้าไม่ได้กำหนดตัวคั่นไว้จะเป็น (,) โดยอัตโนมัติ
console.log(names.join());
// กำหนดค่าตัวขั้นกลางไว้เป็น (_) โดยผลลัพธ์ก็จะเป็น 1_2_3_4
console.log(nums.join('_'));
//
console.log(
  nums
    .filter((x) => {
      return parseInt(x) >= 2;
    })
    .join('_')
);
